docs/Architecture.md
```mermaid
classDiagram
    
    class Type {
        <<Interface>>
    }
    class NumericType {
        <<Interface>>
    }
    class FloatType {
        <<Interface>>
    }
    class IntegerType {
        <<Interface>>
    }

    NumericType --|> Type
    FloatType --|> NumericType
    IntegerType --|> NumericType
    
    class AbstractType {
        <<Abstract>>
    }
    
    AbstractType ..|> Type
    
    Bool --|> AbstractType
    F64 ..|> FloatType
    F64 --|> AbstractType
    I32 ..|> IntegerType
    I32 --|> AbstractType
    I64 ..|> IntegerType
    I64 --|> AbstractType
    Str --|> AbstractType
    Void --|> AbstractType
    
    Arr --|> AbstractType
    Arr *-- Type : elementType
    
    Fun --|> AbstractType
    Fun *-- Type : returnType
    Fun *-- "*" Type : argTypes
```
